#!/usr/bin/perl

# При ошибке радиуса перенаправляет в кабинет пользователя.
# Авторизация по маку, автоматическая регистрация.

use strict;
use warnings FATAL => 'all';

#**********************************************************
=head2 scheme_radius_error()

=cut
#**********************************************************
sub scheme_radius_error {
  user_portal_redirect();
  return 1;
}

#**********************************************************
=head2 scheme_pre_auth()

=cut
#**********************************************************
sub scheme_pre_auth {
  return 1;
}

#**********************************************************
=head2 scheme_auth()

=cut
#**********************************************************
sub scheme_auth {
  cookie_login();
  mac_login();
  return 1;
}

#**********************************************************
=head2 scheme_registration()

=cut
#**********************************************************
sub scheme_registration {
  hotspot_user_registration();
  return 1;
}

1;